src/backend/load-tests/results/ab-health-light-20260209_200401.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /actuator/health
Document Length:        521 bytes

Concurrency Level:      10
Time taken for tests:   3.821 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      919000 bytes
HTML transferred:       521000 bytes
Requests per second:    261.69 [#/sec] (mean)
Time per request:       38.213 [ms] (mean)
Time per request:       3.821 [ms] (mean, across all concurrent requests)
Transfer rate:          234.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     4   38  20.5     34     181
Waiting:        4   38  20.4     33     181
Total:          4   38  20.6     34     181

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     41
  75%     45
  80%     48
  90%     56
  95%     74
  98%    110
  99%    124
 100%    181 (longest request)