src/backend/load-tests/results/ab-health-normal-20260209_200401.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /actuator/health
Document Length:        521 bytes

Concurrency Level:      50
Time taken for tests:   21.502 seconds
Complete requests:      5000
Failed requests:        0
Non-2xx responses:      5000
Total transferred:      4595000 bytes
HTML transferred:       2605000 bytes
Requests per second:    232.53 [#/sec] (mean)
Time per request:       215.023 [ms] (mean)
Time per request:       4.300 [ms] (mean, across all concurrent requests)
Transfer rate:          208.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0      40
Processing:     8  214 124.4    197    1321
Waiting:        7  214 124.3    197    1321
Total:          8  214 124.4    197    1321

Percentage of the requests served within a certain time (ms)
  50%    197
  66%    229
  75%    253
  80%    269
  90%    313
  95%    362
  98%    413
  99%   1082
 100%   1321 (longest request)