src/backend/load-tests/results/ab-prometheus-light-20260209_200401.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /actuator/prometheus
Document Length:        123947 bytes

Concurrency Level:      5
Time taken for tests:   0.403 seconds
Complete requests:      200
Failed requests:        199
   (Connect: 0, Receive: 0, Length: 199, Exceptions: 0)
Total transferred:      27798105 bytes
HTML transferred:       27714905 bytes
Requests per second:    496.88 [#/sec] (mean)
Time per request:       10.063 [ms] (mean)
Time per request:       2.013 [ms] (mean, across all concurrent requests)
Transfer rate:          67442.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     3    9   5.2      8      48
Waiting:        3    9   5.1      8      43
Total:          3    9   5.2      8      48

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%      9
  80%      9
  90%     11
  95%     14
  98%     34
  99%     35
 100%     48 (longest request)